{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 834,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 835,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 836,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 837,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 838,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "E21": 0,
      "E338": 1,
      "E296": 2,
      "E307": 3,
      "E303": 4,
      "E0": 5,
      "E290": 6,
      "T18": 7,
      "E417": 8,
      "E48": 9,
      "E294": 10,
      "E571": 11,
      "E118": 12,
      "E369": 13,
      "E71": 14,
      "E659": 15,
      "E573": 16,
      "E313": 17,
      "E524": 18,
      "E388": 19,
      "E630": 20,
      "E173": 21,
      "E690": 22,
      "E96": 23,
      "E147": 24,
      "E476": 25,
      "E252": 26,
      "E339": 27,
      "E475": 28,
      "E385": 29,
      "E712": 30,
      "E519": 31,
      "T11": 32,
      "E464": 33,
      "E390": 34,
      "E190": 35,
      "E357": 36,
      "E665": 37,
      "E184": 38,
      "E740": 39,
      "E685": 40,
      "T4": 41,
      "E568": 42,
      "E1": 43,
      "E397": 44,
      "E9": 45,
      "E413": 46,
      "E163": 47,
      "E403": 48,
      "E753": 49,
      "E35": 50,
      "E492": 51,
      "E705": 52,
      "E644": 53,
      "E329": 54,
      "E410": 55,
      "E453": 56,
      "E27": 57,
      "E589": 58,
      "E212": 59,
      "E292": 60,
      "E270": 61,
      "E742": 62,
      "E621": 63,
      "E477": 64,
      "E172": 65,
      "E673": 66,
      "E2": 67,
      "E231": 68,
      "E94": 69,
      "E183": 70,
      "E618": 71,
      "E662": 72,
      "E370": 73,
      "E804": 74,
      "E402": 75,
      "E400": 76,
      "E472": 77,
      "E202": 78,
      "E714": 79,
      "E29": 80,
      "E288": 81,
      "E564": 82,
      "E421": 83,
      "E538": 84,
      "E792": 85,
      "E150": 86,
      "E40": 87,
      "E393": 88,
      "E401": 89,
      "E205": 90,
      "E681": 91,
      "E548": 92,
      "E722": 93,
      "E345": 94,
      "T16": 95,
      "E322": 96,
      "E229": 97,
      "E491": 98,
      "E352": 99,
      "E558": 100,
      "E532": 101,
      "E22": 102,
      "E628": 103,
      "E164": 104,
      "E293": 105,
      "E125": 106,
      "E523": 107,
      "E414": 108,
      "E26": 109,
      "E291": 110,
      "E44": 111,
      "E283": 112,
      "E407": 113,
      "E300": 114,
      "E380": 115,
      "E121": 116,
      "E563": 117,
      "E639": 118,
      "E201": 119,
      "E378": 120,
      "E336": 121,
      "E396": 122,
      "E668": 123,
      "E409": 124,
      "E242": 125,
      "E443": 126,
      "E619": 127,
      "E171": 128,
      "E273": 129,
      "E506": 130,
      "E405": 131,
      "E30": 132,
      "E431": 133,
      "E463": 134,
      "E790": 135,
      "E197": 136,
      "E812": 137,
      "E584": 138,
      "T19": 139,
      "E100": 140,
      "E447": 141,
      "E455": 142,
      "E268": 143,
      "E735": 144,
      "E570": 145,
      "E728": 146,
      "E68": 147,
      "E83": 148,
      "E245": 149,
      "E541": 150,
      "E187": 151,
      "E440": 152,
      "E69": 153,
      "E600": 154,
      "E54": 155,
      "E442": 156,
      "E144": 157,
      "E78": 158,
      "E239": 159,
      "E657": 160,
      "E351": 161,
      "E257": 162,
      "E52": 163,
      "E314": 164,
      "E158": 165,
      "E536": 166,
      "E749": 167,
      "E682": 168,
      "E423": 169,
      "E353": 170,
      "E460": 171,
      "E473": 172,
      "E86": 173,
      "E28": 174,
      "E209": 175,
      "E244": 176,
      "E751": 177,
      "E98": 178,
      "E574": 179,
      "E658": 180,
      "E34": 181,
      "E79": 182,
      "E432": 183,
      "E515": 184,
      "E428": 185,
      "E616": 186,
      "E87": 187,
      "E328": 188,
      "E142": 189,
      "E708": 190,
      "E39": 191,
      "E559": 192,
      "E610": 193,
      "E56": 194,
      "E454": 195,
      "E615": 196,
      "E111": 197,
      "E162": 198,
      "E278": 199,
      "E684": 200,
      "E18": 201,
      "E613": 202,
      "E750": 203,
      "E374": 204,
      "E556": 205,
      "E444": 206,
      "E355": 207,
      "E177": 208,
      "E138": 209,
      "E108": 210,
      "E3": 211,
      "E531": 212,
      "E411": 213,
      "E331": 214,
      "E236": 215,
      "E580": 216,
      "E360": 217,
      "E620": 218,
      "E565": 219,
      "E567": 220,
      "E754": 221,
      "E263": 222,
      "E408": 223,
      "E254": 224,
      "E782": 225,
      "E356": 226,
      "E526": 227,
      "E572": 228,
      "E694": 229,
      "E38": 230,
      "E486": 231,
      "E47": 232,
      "E91": 233,
      "E185": 234,
      "T1": 235,
      "E436": 236,
      "E265": 237,
      "E233": 238,
      "E773": 239,
      "E248": 240,
      "E470": 241,
      "E210": 242,
      "E131": 243,
      "E799": 244,
      "E354": 245,
      "E124": 246,
      "E569": 247,
      "E255": 248,
      "E701": 249,
      "E123": 250,
      "E105": 251,
      "E136": 252,
      "E560": 253,
      "E77": 254,
      "E251": 255,
      "E507": 256,
      "E122": 257,
      "E109": 258,
      "E588": 259,
      "E704": 260,
      "T6": 261,
      "E566": 262,
      "E17": 263,
      "E20": 264,
      "E435": 265,
      "E106": 266,
      "E770": 267,
      "E635": 268,
      "E427": 269,
      "E366": 270,
      "T0": 271,
      "E119": 272,
      "E693": 273,
      "E481": 274,
      "E145": 275,
      "E247": 276,
      "E643": 277,
      "E530": 278,
      "E232": 279,
      "T8": 280,
      "E59": 281,
      "E282": 282,
      "E424": 283,
      "E281": 284,
      "E733": 285,
      "E276": 286,
      "E503": 287,
      "E243": 288,
      "E771": 289,
      "E223": 290,
      "E416": 291,
      "E711": 292,
      "E807": 293,
      "E433": 294,
      "T14": 295,
      "E10": 296,
      "E277": 297,
      "E63": 298,
      "T13": 299,
      "E745": 300,
      "E93": 301,
      "E179": 302,
      "E775": 303,
      "E602": 304,
      "E37": 305,
      "E489": 306,
      "E676": 307,
      "E376": 308,
      "E99": 309,
      "E504": 310,
      "E677": 311,
      "E218": 312,
      "E606": 313,
      "E796": 314,
      "E62": 315,
      "E484": 316,
      "E795": 317,
      "E543": 318,
      "E674": 319,
      "E512": 320,
      "E734": 321,
      "E485": 322,
      "E53": 323,
      "E361": 324,
      "E92": 325,
      "E130": 326,
      "E195": 327,
      "E562": 328,
      "E725": 329,
      "E381": 330,
      "E165": 331,
      "E324": 332,
      "E730": 333,
      "E591": 334,
      "E287": 335,
      "E678": 336,
      "E51": 337,
      "E739": 338,
      "E50": 339,
      "E529": 340,
      "E599": 341,
      "E499": 342,
      "E262": 343,
      "E459": 344,
      "E695": 345,
      "E425": 346,
      "E160": 347,
      "E511": 348,
      "E672": 349,
      "E382": 350,
      "E70": 351,
      "E333": 352,
      "E235": 353,
      "E267": 354,
      "E582": 355,
      "E776": 356,
      "E279": 357,
      "E698": 358,
      "E280": 359,
      ".": 360,
      "E542": 361,
      "E715": 362,
      "E334": 363,
      "E285": 364,
      "E744": 365,
      "E762": 366,
      "E341": 367,
      "E757": 368,
      "E641": 369,
      "E550": 370,
      "E127": 371,
      "E652": 372,
      "E368": 373,
      "E156": 374,
      "E189": 375,
      "E203": 376,
      "E522": 377,
      "E721": 378,
      "E215": 379,
      "E261": 380,
      "E810": 381,
      "E717": 382,
      "E805": 383,
      "E192": 384,
      "E219": 385,
      "E176": 386,
      "E193": 387,
      "E116": 388,
      "E392": 389,
      "E480": 390,
      "E636": 391,
      "E603": 392,
      "E151": 393,
      "E579": 394,
      "E434": 395,
      "E648": 396,
      "E350": 397,
      "E778": 398,
      "E230": 399,
      "E518": 400,
      "E437": 401,
      "E586": 402,
      "E258": 403,
      "T9": 404,
      "E81": 405,
      "E448": 406,
      "E32": 407,
      "E554": 408,
      "E134": 409,
      "E161": 410,
      "E680": 411,
      "E462": 412,
      "E395": 413,
      "E601": 414,
      "E793": 415,
      "E152": 416,
      "E347": 417,
      "E809": 418,
      "E461": 419,
      "E609": 420,
      "E719": 421,
      "E768": 422,
      "E103": 423,
      "E637": 424,
      "E181": 425,
      "E330": 426,
      "E438": 427,
      "E266": 428,
      "E348": 429,
      "E166": 430,
      "E483": 431,
      "E310": 432,
      "E607": 433,
      "E780": 434,
      "E207": 435,
      "E632": 436,
      "E583": 437,
      "E759": 438,
      "T17": 439,
      "E36": 440,
      "E102": 441,
      "E801": 442,
      "E718": 443,
      "E772": 444,
      "E726": 445,
      "E669": 446,
      "E115": 447,
      "E651": 448,
      "E107": 449,
      "E663": 450,
      "E544": 451,
      "E371": 452,
      "E646": 453,
      "E495": 454,
      "E661": 455,
      "E496": 456,
      "E787": 457,
      "E55": 458,
      "E783": 459,
      "E418": 460,
      "E359": 461,
      "E769": 462,
      "E466": 463,
      "E702": 464,
      "E724": 465,
      "E240": 466,
      "E199": 467,
      "E465": 468,
      "E126": 469,
      "E33": 470,
      "E696": 471,
      "E135": 472,
      "E633": 473,
      "E46": 474,
      "E482": 475,
      "E456": 476,
      "E592": 477,
      "E654": 478,
      "E598": 479,
      "E221": 480,
      "E469": 481,
      "E533": 482,
      "E604": 483,
      "E155": 484,
      "E180": 485,
      "E666": 486,
      "E169": 487,
      "E271": 488,
      "E337": 489,
      "E551": 490,
      "E535": 491,
      "E510": 492,
      "E597": 493,
      "E76": 494,
      "E320": 495,
      "E224": 496,
      "E114": 497,
      "E514": 498,
      "E406": 499,
      "E467": 500,
      "E377": 501,
      "E5": 502,
      "E264": 503,
      "E327": 504,
      "E208": 505,
      "E686": 506,
      "E274": 507,
      "E488": 508,
      "E101": 509,
      "E747": 510,
      "E238": 511,
      "E521": 512,
      "E703": 513,
      "E367": 514,
      "E710": 515,
      "E61": 516,
      "E364": 517,
      "E700": 518,
      "E299": 519,
      "E216": 520,
      "E743": 521,
      "E585": 522,
      "E306": 523,
      "E129": 524,
      "E441": 525,
      "E213": 526,
      "E713": 527,
      "E760": 528,
      "E479": 529,
      "E691": 530,
      "E24": 531,
      "E326": 532,
      "E471": 533,
      "E305": 534,
      "E650": 535,
      "E617": 536,
      "E45": 537,
      "E649": 538,
      "E159": 539,
      "E321": 540,
      "E706": 541,
      "E12": 542,
      "E692": 543,
      "E42": 544,
      "E675": 545,
      "E764": 546,
      "E732": 547,
      "E168": 548,
      "E450": 549,
      "E23": 550,
      "E667": 551,
      "E110": 552,
      "E445": 553,
      "E699": 554,
      "E301": 555,
      "E298": 556,
      "E656": 557,
      "E756": 558,
      "E58": 559,
      "E478": 560,
      "E137": 561,
      "E16": 562,
      "E157": 563,
      "E595": 564,
      "E95": 565,
      "E697": 566,
      "E634": 567,
      "E422": 568,
      "E358": 569,
      "E234": 570,
      "E500": 571,
      "E49": 572,
      "E14": 573,
      "T5": 574,
      "E527": 575,
      "E468": 576,
      "T15": 577,
      "E784": 578,
      "E517": 579,
      "E797": 580,
      "E474": 581,
      "E174": 582,
      "E487": 583,
      "E399": 584,
      "E343": 585,
      "E458": 586,
      "E746": 587,
      "E194": 588,
      "E372": 589,
      "E788": 590,
      "E687": 591,
      "E553": 592,
      "E89": 593,
      "E167": 594,
      "[OUT]": 595,
      "E297": 596,
      "E269": 597,
      "E811": 598,
      "E323": 599,
      "E502": 600,
      "E31": 601,
      "E309": 602,
      "E689": 603,
      "E344": 604,
      "E611": 605,
      "E204": 606,
      "E647": 607,
      "E709": 608,
      "E64": 609,
      "E379": 610,
      "E387": 611,
      "E302": 612,
      "E642": 613,
      "E132": 614,
      "E736": 615,
      "E802": 616,
      "E520": 617,
      "E41": 618,
      "E317": 619,
      "E362": 620,
      "E727": 621,
      "E766": 622,
      "E645": 623,
      "E342": 624,
      "E19": 625,
      "E525": 626,
      "E237": 627,
      "E196": 628,
      "E451": 629,
      "E228": 630,
      "E214": 631,
      "T10": 632,
      "E549": 633,
      "E513": 634,
      "E249": 635,
      "E304": 636,
      "E655": 637,
      "E720": 638,
      "E67": 639,
      "E608": 640,
      "E622": 641,
      "E449": 642,
      "E741": 643,
      "E25": 644,
      "E332": 645,
      "E97": 646,
      "E311": 647,
      "E763": 648,
      "E260": 649,
      "E587": 650,
      "E346": 651,
      "E640": 652,
      "E8": 653,
      "E752": 654,
      "E389": 655,
      "E539": 656,
      "E383": 657,
      "T2": 658,
      "E629": 659,
      "E295": 660,
      "E497": 661,
      "E808": 662,
      "E546": 663,
      "E386": 664,
      "E200": 665,
      "E420": 666,
      "E104": 667,
      "E781": 668,
      "E578": 669,
      "E545": 670,
      "E143": 671,
      "E612": 672,
      "E774": 673,
      "E191": 674,
      "E528": 675,
      "E286": 676,
      "E625": 677,
      "T12": 678,
      "E72": 679,
      "E671": 680,
      "E738": 681,
      "E253": 682,
      "E557": 683,
      "E707": 684,
      "E217": 685,
      "E74": 686,
      "E426": 687,
      "E220": 688,
      "E638": 689,
      "E748": 690,
      "E4": 691,
      "E226": 692,
      "E493": 693,
      "E798": 694,
      "E316": 695,
      "E178": 696,
      "E188": 697,
      "E594": 698,
      "E375": 699,
      "E627": 700,
      "E340": 701,
      "E779": 702,
      "E731": 703,
      "E593": 704,
      "E11": 705,
      "E623": 706,
      "E576": 707,
      "E349": 708,
      "E182": 709,
      "E15": 710,
      "E284": 711,
      "E767": 712,
      "E148": 713,
      "E794": 714,
      "E65": 715,
      "E60": 716,
      "E225": 717,
      "E508": 718,
      "E113": 719,
      "E575": 720,
      "E363": 721,
      "E227": 722,
      "E75": 723,
      "E272": 724,
      "E683": 725,
      "E308": 726,
      "E547": 727,
      "E624": 728,
      "E552": 729,
      "E791": 730,
      "E170": 731,
      "E419": 732,
      "E153": 733,
      "E7": 734,
      "E13": 735,
      "E146": 736,
      "E73": 737,
      "E391": 738,
      "E318": 739,
      "E537": 740,
      "E660": 741,
      "E439": 742,
      "E509": 743,
      "E429": 744,
      "E404": 745,
      "E80": 746,
      "E596": 747,
      "E66": 748,
      "E175": 749,
      "E716": 750,
      "E777": 751,
      "E90": 752,
      "E139": 753,
      "E415": 754,
      "E206": 755,
      "E498": 756,
      "E806": 757,
      "E670": 758,
      "E6": 759,
      "E516": 760,
      "E384": 761,
      "E430": 762,
      "E85": 763,
      "E141": 764,
      "E373": 765,
      "E315": 766,
      "E186": 767,
      "E800": 768,
      "E133": 769,
      "E211": 770,
      "E446": 771,
      "E626": 772,
      "E88": 773,
      "E614": 774,
      "E688": 775,
      "E84": 776,
      "E452": 777,
      "E312": 778,
      "E501": 779,
      "E494": 780,
      "E577": 781,
      "E561": 782,
      "E723": 783,
      "E275": 784,
      "E128": 785,
      "E534": 786,
      "E653": 787,
      "E605": 788,
      "E259": 789,
      "E581": 790,
      "E335": 791,
      "E394": 792,
      "E490": 793,
      "E140": 794,
      "E664": 795,
      "E761": 796,
      "E398": 797,
      "E803": 798,
      "E785": 799,
      "E737": 800,
      "E117": 801,
      "E82": 802,
      "E679": 803,
      "E765": 804,
      "E43": 805,
      "E755": 806,
      "E250": 807,
      "E256": 808,
      "E786": 809,
      "E246": 810,
      "E631": 811,
      "E789": 812,
      "E154": 813,
      "T3": 814,
      "E120": 815,
      "E365": 816,
      "E222": 817,
      "E325": 818,
      "E758": 819,
      "E198": 820,
      "E57": 821,
      "E412": 822,
      "E505": 823,
      "E289": 824,
      "E319": 825,
      "E149": 826,
      "E540": 827,
      "E457": 828,
      "E241": 829,
      "E729": 830,
      "E555": 831,
      "E112": 832,
      "E590": 833
    },
    "unk_token": "[UNK]"
  }
}